In [3]:
import pandas as pd

In [7]:
dfu = pd.read_csv("Datasets/Housing Lottery Data - Greenpoint 2025 Lottery Units.csv")
dfu

,"237 McGuinness Blvd, Brooklyn, NY 11222",Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
0,"Eligible Income: $65,109 - $227,500",NaN,NaN,NaN,NaN,NaN,NaN
1,Unit Size,NaN,MonthlyRent1,Units Available,Asset Limit,Household Size2,Annual Household Income3\nMinimum – Maximum
2,Studio,80% AREA MEDIAN INCOME,"$1,757.00",2,"$124,240.00",1 people 2 people,"$65,109.00-$90,720.00 $65,109.00-$103,680.00"
3,1 Bedroom,NaN,"$1,875.00",4,NaN,1 people 2 people 3 people,"$69,909.00-$90,720.00 $69,909.00-$103,680.00 $..."
4,2 Bedroom,NaN,"$2,232.00",7,NaN,2 people 3 people 4 people 5 people,"$84,069.00-$103,680.00 $84,069.00-$116,640.00 ..."
5,Studio,130% AREA MEDIAN INCOME,"$3,423.00",3,"$201,890.00",1 people 2 people,"$117,360.00-$147,420.00 $117,360.00-$168,480.00"
6,1 Bedroom,NaN,"$3,661.00",1,NaN,1 people 2 people 3 people,"$125,520.00-$147,420.00 $125,520.00-$168,480.0..."
7,2 Bedroom,NaN,"$4,376.00",4,NaN,2 people 3 people 4 people 5 people,"$150,035.00-$168,480.00 $150,035.00-$189,540.0..."
8,NaN,NaN,NaN,21,NaN,NaN,NaN
9,"65 Dupont St, Brooklyn, NY 11222",NaN,NaN,NaN,NaN,NaN,NaN
10,"Eligible Income: $68,949 - $227,500",NaN,NaN,NaN,NaN,NaN,NaN
11,Unit Size,NaN,MonthlyRent1,Units Available,Asset Limit,Household Size2,Annual Household Income3\nMinimum – Maximum
12,Studio,80% AREA MEDIAN INCOME,"$1,869.00",16,"$124,240.00",1 people 2 people,"$68,949.00-$90,720.00 $68,949.00-$103,680.00"
13,1 Bedroom,NaN,"$1,993.00",27,NaN,1 people 2 people 3 people,"$73,955.00-$90,720.00 $73,955.00-$103,680.00 $..."
14,2 Bedroom,NaN,"$2,375.00",9,NaN,2 people 3 people 4 people 5 people,"$88,972.00-$103,680.00 $88,972.00-$116,640.00 ..."
15,Studio,130% AREA MEDIAN INCOME,"$3,423.00",10,"$201,890.00",1 people 2 people,"$122,229.00-$147,420.00 $122,229.00-$168,480.00"
16,1 Bedroom,NaN,"$3,661.00",16,NaN,1 people 2 people 3 people,"$131,143.00-$147,420.00 $131,143.00-$168,480.0..."
17,2 Bedroom,NaN,"$4,376.00",6,NaN,2 people 3 people 4 people 5 people,"$157,578.00-$168,480.00 $157,578.00-$189,540.0..."
18,NaN,NaN,NaN,84,NaN,NaN,NaN

In [19]:
dfu.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19 entries, 0 to 18
Data columns (total 7 columns):
 #   Column                                   Non-Null Count  Dtype
---  ------                                   --------------  -----
 0   237 McGuinness Blvd, Brooklyn, NY 11222  17 non-null     object
 1   Unnamed: 1                               4 non-null      object
 2   Unnamed: 2                               14 non-null     object
 3   Unnamed: 3                               16 non-null     object
 4   Unnamed: 4                               6 non-null      object
 5   Unnamed: 5                               14 non-null     object
 6   Unnamed: 6                               14 non-null     object
dtypes: object(7)
memory usage: 1.2+ KB

In [21]:
dfu.head()

,"237 McGuinness Blvd, Brooklyn, NY 11222",Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
0,"Eligible Income: $65,109 - $227,500",NaN,NaN,NaN,NaN,NaN,NaN
1,Unit Size,NaN,MonthlyRent1,Units Available,Asset Limit,Household Size2,Annual Household Income3\nMinimum – Maximum
2,Studio,80% AREA MEDIAN INCOME,"$1,757.00",2,"$124,240.00",1 people 2 people,"$65,109.00-$90,720.00 $65,109.00-$103,680.00"
3,1 Bedroom,NaN,"$1,875.00",4,NaN,1 people 2 people 3 people,"$69,909.00-$90,720.00 $69,909.00-$103,680.00 $..."
4,2 Bedroom,NaN,"$2,232.00",7,NaN,2 people 3 people 4 people 5 people,"$84,069.00-$103,680.00 $84,069.00-$116,640.00 ..."

In [59]:
dfu.columns = ['Unit Size', 'AMI', 'Monthly Rent', 'Units Available', 'Asset Limit', 'Household Size', 'Income Range']
dfu.head()

,Unit Size,AMI,Monthly Rent,Units Available,Asset Limit,Household Size,Income Range
0,"Eligible Income: $65,109 - $227,500",NaN,NaN,NaN,NaN,NaN,NaN
1,Unit Size,NaN,MonthlyRent1,Units Available,Asset Limit,Household Size2,Annual Household Income3\nMinimum – Maximum
2,Studio,80% AREA MEDIAN INCOME,"$1,757.00",2,"$124,240.00",1 people 2 people,"$65,109.00-$90,720.00 $65,109.00-$103,680.00"
3,1 Bedroom,NaN,"$1,875.00",4,NaN,1 people 2 people 3 people,"$69,909.00-$90,720.00 $69,909.00-$103,680.00 $..."
4,2 Bedroom,NaN,"$2,232.00",7,NaN,2 people 3 people 4 people 5 people,"$84,069.00-$103,680.00 $84,069.00-$116,640.00 ..."

In [89]:
# Drop rows without rent values
dfu = df[df['Monthly Rent'].str.contains(r'\$\d+', na=False)]
dfu.reset_index(drop=True, inplace=True)

In [87]:
#Extract min income from “Income Range” column
import re

def extract_min_income(text):
    match = re.findall(r'\d{2,3},?\d{3}\.?\d*', str(text))
    if match:
        return float(match[0].replace(',', ''))
    return None

dfu['Min Income'] = dfu['Income Range'].apply(extract_min_income)
dfu

,Unit Size,AMI,Monthly Rent,Units Available,Asset Limit,Household Size,Income Range,Min Income,Rent Burden at $50K
0,Studio,80% AREA MEDIAN INCOME,1757.0,2,"$124,240.00",1 people 2 people,"$65,109.00-$90,720.00 $65,109.00-$103,680.00",65109.0,42.168
1,1 Bedroom,NaN,1875.0,4,NaN,1 people 2 people 3 people,"$69,909.00-$90,720.00 $69,909.00-$103,680.00 $...",69909.0,45.000
2,2 Bedroom,NaN,2232.0,7,NaN,2 people 3 people 4 people 5 people,"$84,069.00-$103,680.00 $84,069.00-$116,640.00 ...",84069.0,53.568
3,Studio,130% AREA MEDIAN INCOME,3423.0,3,"$201,890.00",1 people 2 people,"$117,360.00-$147,420.00 $117,360.00-$168,480.00",117360.0,82.152
4,1 Bedroom,NaN,3661.0,1,NaN,1 people 2 people 3 people,"$125,520.00-$147,420.00 $125,520.00-$168,480.0...",125520.0,87.864
5,2 Bedroom,NaN,4376.0,4,NaN,2 people 3 people 4 people 5 people,"$150,035.00-$168,480.00 $150,035.00-$189,540.0...",150035.0,105.024
6,Studio,80% AREA MEDIAN INCOME,1869.0,16,"$124,240.00",1 people 2 people,"$68,949.00-$90,720.00 $68,949.00-$103,680.00",68949.0,44.856
7,1 Bedroom,NaN,1993.0,27,NaN,1 people 2 people 3 people,"$73,955.00-$90,720.00 $73,955.00-$103,680.00 $...",73955.0,47.832
8,2 Bedroom,NaN,2375.0,9,NaN,2 people 3 people 4 people 5 people,"$88,972.00-$103,680.00 $88,972.00-$116,640.00 ...",88972.0,57.000
9,Studio,130% AREA MEDIAN INCOME,3423.0,10,"$201,890.00",1 people 2 people,"$122,229.00-$147,420.00 $122,229.00-$168,480.00",122229.0,82.152
10,1 Bedroom,NaN,3661.0,16,NaN,1 people 2 people 3 people,"$131,143.00-$147,420.00 $131,143.00-$168,480.0...",131143.0,87.864
11,2 Bedroom,NaN,4376.0,6,NaN,2 people 3 people 4 people 5 people,"$157,578.00-$168,480.00 $157,578.00-$189,540.0...",157578.0,105.024

In [91]:
#Clean Monthly Rent
dfu['Monthly Rent'] = dfu['Monthly Rent'].str.replace(r'[\$,]', '', regex=True).astype(float)
dfu

,Unit Size,AMI,Monthly Rent,Units Available,Asset Limit,Household Size,Income Range,Min Income
0,Studio,80% AREA MEDIAN INCOME,1757.0,2,"$124,240.00",1 people 2 people,"$65,109.00-$90,720.00 $65,109.00-$103,680.00",65109.0
1,1 Bedroom,NaN,1875.0,4,NaN,1 people 2 people 3 people,"$69,909.00-$90,720.00 $69,909.00-$103,680.00 $...",69909.0
2,2 Bedroom,NaN,2232.0,7,NaN,2 people 3 people 4 people 5 people,"$84,069.00-$103,680.00 $84,069.00-$116,640.00 ...",84069.0
3,Studio,130% AREA MEDIAN INCOME,3423.0,3,"$201,890.00",1 people 2 people,"$117,360.00-$147,420.00 $117,360.00-$168,480.00",117360.0
4,1 Bedroom,NaN,3661.0,1,NaN,1 people 2 people 3 people,"$125,520.00-$147,420.00 $125,520.00-$168,480.0...",125520.0
5,2 Bedroom,NaN,4376.0,4,NaN,2 people 3 people 4 people 5 people,"$150,035.00-$168,480.00 $150,035.00-$189,540.0...",150035.0
6,Studio,80% AREA MEDIAN INCOME,1869.0,16,"$124,240.00",1 people 2 people,"$68,949.00-$90,720.00 $68,949.00-$103,680.00",68949.0
7,1 Bedroom,NaN,1993.0,27,NaN,1 people 2 people 3 people,"$73,955.00-$90,720.00 $73,955.00-$103,680.00 $...",73955.0
8,2 Bedroom,NaN,2375.0,9,NaN,2 people 3 people 4 people 5 people,"$88,972.00-$103,680.00 $88,972.00-$116,640.00 ...",88972.0
9,Studio,130% AREA MEDIAN INCOME,3423.0,10,"$201,890.00",1 people 2 people,"$122,229.00-$147,420.00 $122,229.00-$168,480.00",122229.0
10,1 Bedroom,NaN,3661.0,16,NaN,1 people 2 people 3 people,"$131,143.00-$147,420.00 $131,143.00-$168,480.0...",131143.0
11,2 Bedroom,NaN,4376.0,6,NaN,2 people 3 people 4 people 5 people,"$157,578.00-$168,480.00 $157,578.00-$189,540.0...",157578.0

In [93]:
#Average minimum income required
avg_min_income = dfu['Min Income'].mean()
print(f"Average minimum income required: ${avg_min_income:,.2f}")

Average minimum income required: $104,569.00

In [75]:
unaffordable = dfu[dfu['Min Income'] > 50000].shape[0]
total = df.shape[0]
print(f"Units unaffordable to $50K earners: {unaffordable}/{total} ({(unaffordable/total)*100:.1f}%)")

Units unaffordable to $50K earners: 12/12 (100.0%)

In [101]:
dfu['Rent Burden at $50K'] = (dfu['Monthly Rent'] * 12) / 50000 * 100
Reent burden = dfu[['Unit Size', 'Monthly Rent', 'Min Income', 'Rent Burden at $50K']].head()

SyntaxError: invalid syntax (1019741311.py, line 2)

In [99]:
dfu.to_csv('Rent Burden.csv')

In [15]:
dfi = pd.read_csv("Datasets/Housing Lottery Data - household income in NYC.csv")
dfi

    Year Household income-Williamsburg/Greenpoint Household income-NYC
0   2005                                  $46,150              $65,753
1   2006                                  $47,135              $67,814
2   2007                                  $57,941              $69,001
3   2008                                  $56,331              $69,807
4   2009                                  $53,342              $68,027
5   2010                                  $55,984              $65,162
6   2011                                  $61,097              $64,292
7   2012                                  $64,120              $64,881
8   2013                                  $65,719              $65,473
9   2014                                  $71,542              $65,575
10  2015                                  $82,931              $68,898
11  2016                                  $85,205              $71,959
12  2017                                  $91,865              $73,004
13  2018                                  $94,912              $75,073
14  2019                                 $113,772              $80,344
15  2020                                      NaN                  NaN
16  2021                                 $111,747              $74,950
17  2022                                  $98,747              $77,550
18  2023                                 $111,492              $76,577

In [17]:
dfr = pd.read_csv("Datasets/Housing Lottery Data - Rising rents in Greenpoint.csv")
dfr

,areaName,Borough,areaType,2010-01,2010-02,2010-03,2010-04,2010-05,2010-06,2010-07,...,2024-07,2024-08,2024-09,2024-10,2024-11,2024-12,2025-01,2025-02,2025-03,2025-04
0,Greenpoint,Brooklyn,neighborhood,2300,2225,2350,2300,2300,2300,2400,...,4400,4500,4500,4525,4649,4650,4620,4650,4596,4725